Repository: IllarionRUS/Warthunder_parser
Catalog: Properties/Resources.*.resx
Languages: ru

# bnt_ToMetrical
source: Metrical
ru: В метрическую

# btn_Help
source: Help
ru: Помощь

# btn_Open
source: Open
ru: Открыть

# btn_Preferences
source: Preferences
ru: Настройки

# btn_Save
source: Save
ru: Сохранить

# btn_ToImperial
source: Imperial(UK)
ru: В имперскую

# common_apply
source: Apply
ru: Применить

# common_cancel
source: Cancel
ru: Отмена

# common_error
source: Error!
ru: Произошла ошибка!

# critical_recorder_error
source: Error of critical recorder
ru: Сбой критического сборщика данных

# dlg_CS_btn_Add
source: Add
ru: Добавить

# dlg_CS_btn_Remove
source: Remove
ru: Удалить

# dlg_CS_cb_AltFeets
source: Altitude in feets
ru: Высота в футах

# dlg_CS_cb_ExcelSelectedOnly
source: Copy into Excel only selected fields
ru: Копировать в Excel только выбранный диапазон

# dlg_CS_cb_Filters
source: Use filters
ru: Использовать фильтры

# dlg_CS_cb_Outlier
source: Outliers filter
ru: Фильтр выбросов

# dlg_CS_g_Filters
source: Filters
ru: Фильтры

# dlg_CS_lbl_ConnectionTimeout
source: Connection timeout, ms:
ru: Ожидание подключения, мс:

# dlg_CS_lbl_Delay
source: Request delay, ms:
ru: Интервал запросов, мс:

# dlg_CS_lbl_DelayNote
source: If delay is 0 next request will be send after previous will be completed
ru: При нулевом значении, запрос посылается по выполнению предыдущего

# dlg_CS_lbl_Interpolation
source: Interpolation interval, ms:
ru: Интервал интерполяции, мс:

# dlg_CS_Title
source: Data capture settings
ru: Настройки сбора данных

# dlg_GS_cb_AddGrid
source: Additional grid on
ru: Включить дополнительную

# dlg_GS_cb_AxisColor
source: Axis colors are same as curves
ru: Оси цвета линий

# dlg_GS_cb_MainGrid
source: Main grid on
ru: Включить основную

# dlg_GS_cb_UseSmoothing
source: On
ru: Использовать

# dlg_GS_g_Grid
source: Grid
ru: Сетка

# dlg_GS_g_Smoothing
source: Smoothing
ru: Сглаживание

# dlg_GS_lbl_Font
source: Font size:
ru: Размер шрифта подписей:

# dlg_GS_Title
source: Graphs preferences
ru: Настройки графиков

# dlg_Help_Content
source: How to use: - Press Start or F9 to begin data collection in battle/test flight. Before you start check "Altitude in feets" setting; - To finish collection press Stop or F10 - For data copying into Excel press appropriate button or use Ctrl+C/Ctrl+V. - PREFERENCES: At data collection preferences it is possible to add or remove input data filters. They blocks collection of data from fields with same names. Exact names you can check at http://127.0.0.1:8111/indicators and http://127.0.0.1:8111/state. Saving of filters list now is not available but it's possible to change Filters.xml as you wish. It is possible to change requests interval and interpolation interval. Request interval will be used at next data collection, interpolation interval changing will cause recalculation of data after Apply pressed. Also you can set which data to copy to Excel - all cells or only selected. Outliers filter(filtering of extremal values) is not working now. "Altitude in feets" - by default altitude unit is meter but for most of UK planes web-map show altitude in feets, for proper calculations set this checkbox on. - METRICAL and IMPERIAL(UK) - units conversion - GRAPHS in fact, are better to build in Excel, but for quick analysis they can be built right in app: Setting axis is available only after data was collected. To build graphs select X-Axis at dropdown and Y-Axis by checkboxes - GRAPHS PREFERENCES - On/off curve smoothing, setting up smoothing interval. Without smoothing graphs will be built from raw data. Also there is some interface settings. - SAVE - save all data and graphs - LOAD - open saved data and graphs
ru: Как работать: - Нажимаем Start или F9 для начала сбора данных при запущеном бое(или пробном вылете, можно в паузе, данные все равно идут). Перед запуском обратите внимание на настройку "Высота в футах" - По окончанию записи нажимаем F10 или Stop. - Для экспорта в Excel либо нажимаем соответсвующую кнопку, либо ручками: Ctrl-C Ctrl-V работает. По умолчанию, при щелчке по кнопке экспорта копируются выбранные столбцы на всем диапазоне. В настройках можно указать копирование только выбранного диапазона. - НАСТРОЙКИ: В настройках фильтра можно добавлять и удалять фильтры входных данных. Они блокируют генерацию данных из полей с соответствующими именами, предотвращая замусоривание панели выбора столбцов, посмотреть точное название имен вы можете по адресу http://127.0.0.1:8111/indicators и http://127.0.0.1:8111/state. Сохранение списка не предусмотрено, но можно править Filter.xml в папке приложения по своему вкусу. Можно изменить интервал запросов и интервал интерполяции. Интервал запросов вступает в силу при начале нового сбора данных, смена интервала интерполяции и соответствующие изменения в таблице происходят по щелчку на кнопке "Применить". Также можно настроить копировать ли всю таблицу или только выбранный диапазон при экспорте в Excel. Фильтр выбросов (отсеивание экстремальных значений) пока что не работает "Высота в футах" - по умолчанию сбор высоты идет в метрах, если в web-карту идут данные в футах(на многих британских самолетах это так) ставим этот чекбокс. -"В МЕТРИЧЕСКУЮ" и "В ИМПЕРСКУЮ" выполняют конвертацию едениц измерения - ГРАФИКИ, на самом деле, красивее рисовать в том же экселе, но для быстрого просмотра можно и тут: Выбираем оси графика(доступно только после сбора данных) - абсциссу(Х) из выпадающего списка и ординаты(Y) чекбоксами - "НАСТРОЙКИ ГРАФИКОВ" - Включаем/выключаем сглаживание кривой, настраиваем интервал сглаживания. Без сглаживания будет отображаться т.н. RAW-данные (в чистом виде) + всякие интерфейсные полезности - "СОХРАНИТЬ" - сохраняет все данные и графики - "ОТКРЫТЬ" - открыть ранее сохраненные графики и данные

# lbl_Ordinata
source: Y-Axis:
ru: Ось ординат:

# lbl_Params
source: Data to show
ru: Параметры для отображения:

# recorder_failed
source: Collection failed
ru: Не удалось собрать данные.

# save_error
source: No data to save
ru: Нет данных для сохранения

# state_collecting
source: Data collection in progress. Press Stop or F10 to finish.
ru: Идет сбор данных, нажмите Stop или F10 для завершения.

# state_failed
source: Data collection finished with errors. Press start or F9 to collect new data.
ru: Сбор данных завершился с ошибками. Нажмите Start или F9 для начала нового сбора.

# state_recorder_failed_format
source: Recorder {0} finished collection with error: {1}
ru: Сборщик {0} прекратил сбор с сообщением: {1}

# state_success
source: Data collection finished successfully! Press Start or F9 to collect new data.
ru: Данные успешно собраны. Нажмите Start или F9 для начала нового сбора.

# tab_Data
source: Capture
ru: Сбор данных

# tab_Graph
source: Graphs
ru: Графики

# tab_Measures
source: Measures
ru: Измерения

# dlg_GS_cb_AxisLbl
source: Axis titles
ru: Подписи осей

# dlg_GS_cb_ShowLegend
source: Show legend
ru: Показывать легенду

# dlg_GS_g_Legend
source: Legend
ru: Легенда

# dlg_GS_lbl_SmoothLevel
source: Level of smoothing, pixels:
ru: Размер выборки, пиксели:

# btn_Compare_Add
source: Add
ru: Добавить

# btn_Compare_Remove
source: Remove
ru: Удалить

# tab_Compare
source: Compare
ru: Сравнить

# lbl_Compare_Sources
source: Sources:
ru: Источники данных:
